1s/ERP/extensions/liko/AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтбору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КРазмещению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/InformationRegisters/СостоянияЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовПоставщикам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаказовПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПоступления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/СостоянияЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовПоставщикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/CommonModules/Лико_Склады/Ext/Module.bsl
Функция ОстаткиПоСкладу(РабочийЦентрЯчейкаМассивРЦМассивЯчеек,НаДату, СписокВидовНОменклатуры = Неопределено) Экспорт  //+Лико m.shenderov 12.09.2017
	
	Дата=?(ЗначениеЗаполнено(НаДату),НаДату, Дата(3999, 12, 31, 23, 59, 59));	
	
	МассивЯчеек = Новый Массив;
	ТипРеквизита = ТипЗнч(РабочийЦентрЯчейкаМассивРЦМассивЯчеек);
	Если ТипРеквизита = Тип("СправочникСсылка.РабочиеЦентры") Тогда
		МассивЯчеек.Добавить(РабочийЦентрЯчейкаМассивРЦМассивЯчеек.ЛикоЯчейка);
	ИначеЕсли ТипРеквизита = Тип("СправочникСсылка.СкладскиеЯчейки") Тогда
		МассивЯчеек.Добавить(РабочийЦентрЯчейкаМассивРЦМассивЯчеек);
	ИначеЕсли ТипРеквизита = Тип("Массив") Тогда
		Для каждого ЭлементМассива из РабочийЦентрЯчейкаМассивРЦМассивЯчеек Цикл
			Если ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.РабочиеЦентры") Тогда
				МассивЯчеек.Добавить(ЭлементМассива.ЛикоЯчейка);
			ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.СкладскиеЯчейки") Тогда
				МассивЯчеек.Добавить(ЭлементМассива);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Количество,
	|	ТоварыВЯчейкахОстатки.Упаковка.Числитель * ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоУУ
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Дата, Ячейка В (&МассивЯчеек)) КАК ТоварыВЯчейкахОстатки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ФильтрПоВидамНоменклатуры
	|				ТОГДА ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры В (&СписокВидовНОменклатуры)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("МассивЯчеек", МассивЯчеек); 	
	Запрос.УстановитьПараметр("Дата", Дата); 	
	
	Если СписокВидовНОменклатуры <> Неопределено И ТипЗнч(СписокВидовНОменклатуры) = Тип("Массив") И СписокВидовНОменклатуры.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ФильтрПоВидамНоменклатуры", Истина); 	
		Запрос.УстановитьПараметр("СписокВидовНОменклатуры", СписокВидовНОменклатуры);
	Иначе
		ФильтрПоВидамНоменклатуры=ПолучитьФильтрПоВидамНоменклатуры();
		Запрос.УстановитьПараметр("ФильтрПоВидамНоменклатуры",ФильтрПоВидамНоменклатуры.ФильтрПоВидамНоменклатуры ); 	
		Запрос.УстановитьПараметр("СписокВидовНОменклатуры",ФильтрПоВидамНоменклатуры.СписокВидовНОменклатуры ); 	
	КонецЕсли;

	Возврат Запрос.Выполнить(); 
	
КонецФункции //ОстаткиПоРабочемуЦентру -Лико m.shenderov 12.09.2017


Функция ПолучитьФильтрПоВидамНоменклатуры() Экспорт //+Лико m.shenderov 27.01.2018  
	СписокЗначений= Новый Массив;
	ФилтьрПоВидамНоменклатуры= Справочники.Лико_РабочиеМеста.ПолучитьСвойство("УстанавливатьФильтрПоВидамНменклатуры",Ложь);
	Если  ФилтьрПоВидамНоменклатуры Тогда
		Для каждого ОтборВида Из ПараметрыСеанса.Лико_РабочееМесто.ВидыНаоменклатурыДляФильтра	 Цикл
			
			СписокЗначений.Добавить(ОтборВида.ВидНоменклатуры);
		КонецЦикла;
		
		
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ФильтрПоВидамНоменклатуры",ФилтьрПоВидамНоменклатуры);
	Структура.Вставить("СписокВидовНОменклатуры",СписокЗначений);
	
	Возврат Структура;	
	
КонецФункции  //-Лико m.shenderov 27.01.2018

//+ ---> Лико2.5 m.shenderov 01.04.2022

Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	ТипДокумента = ТипЗнч(Документ);
	
	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ТипДокумента = Тип("ДокументОбъект.Лико_БланкЭтапа") Тогда
			
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_ТоварыКРаспределению);
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ЛикоПартииКликов);
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_ЗакрытиеБланка);
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_ПромежуточныйВыпуск);
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ДвиженияСерийТоваров);
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_РаскройМатериаловПланФакт);

		ИначеЕсли ТипДокумента = Тип("ДокументОбъект.Лико_ПодготовкаМатериалов") Тогда
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_МатериалыВРезерве);
		ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ЭтапПроизводства2_2") Или ТипДокумента = Тип("ДокументОбъект.ДвижениеПродукцииИМатериалов") Тогда
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_ЗакрытиеБланка);
		ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Или
			ТипДокумента = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Или  
			ТипДокумента = Тип("ДокументОбъект.ВозвратСырьяОтПереработчика") Или 
			ТипДокумента = Тип("ДокументОбъект.ПоступлениеОтПереработчика")  
			Тогда 	
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_ТоварыКПоступлению); 
		ИначеЕсли ТипДокумента = Тип("ДокументОбъект.Лико_ПередачаТоваров") Тогда 	
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_ТоварыНаОтветственномХранении);
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ДвиженияСерийТоваров);
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.Лико_ОснасткаПоЗаказу);
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_СписаниеНаЗаказ);
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_КонтрольВозвратовПоставщику);  		
		ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ЛикоРаспределениеРасходовПоЭтапам") Тогда 	
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_РаспределениеМатериалов);  		
			
			
		ИначеЕсли ТипДокумента = Тип("ДокументОбъект.Лико_ВыполненныеРаботы") Тогда 	
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_ВыполненныеРаботы);
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_ЗатратыПоЗаказу); 
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_ЗатратыПоЗаказуДляОтгрузки);
		ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ВозвратТоваровПоставщику") Тогда 	
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Лико_КонтрольВозвратовПоставщику); 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Параметры;
КонецФункции

 Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
    ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_МатериалыВРезерве");
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_ТоварыКПоступлению");
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_ТоварыКРаспределению");
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ЛикоПартииКликов");
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_ЗакрытиеБланка"); 
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_РаспределениеМатериалов"); 
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_ПромежуточныйВыпуск"); 
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ДвиженияСерийТоваров");
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "СвободныеОстатки");
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "СерийТоваров");  
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_ТоварыНаОтветственномХранении");  	
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_ОснасткаПоЗаказу");  	
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_СписаниеНаЗаказ");  	
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_КонтрольВозвратовПоставщику"); 
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_ВыполненныеРаботы"); 
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_ЗатратыПоЗаказу"); 
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_ЗатратыПоЗаказуДляОтгрузки");
    ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Лико_РаскройМатериаловПланФакт");
	
КонецПроцедуры                    

// Дополняет текст запроса механизма проверки даты запрета по таблице изменений.
// 
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 
// Возвращаемое значение:
//	Соответствие - соответствие имен таблиц изменения регистров и текстов запросов.
//	
Функция ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос) Экспорт

	СоответствиеТекстовЗапросов = Новый Соответствие();
	Возврат СоответствиеТекстовЗапросов;
	
КонецФункции


// Возвращает тексты запросов для сторнирования движений при исправлении документов
// 
// Параметры:
// 	МетаданныеДокумента - ОбъектМетаданныхДокумент - Метаданные документа, который проводится.
// 
// Возвращаемое значение:
// 	Соответствие - Соответствие полного имени регистра тексту запроса сторнирования
//
Функция ТекстыЗапросовСторнирования(МетаданныеДокумента) Экспорт
	
	
	ТекстыЗапросов = Новый Соответствие();
	
		
	Возврат ТекстыЗапросов;
	
КонецФункции


//- <--- Лико2.5 m.shenderov 01.04.2022


Процедура ЗакрытьЗаказНаСервере(ЗаказПоставщику) Экспорт  
	УстановитьПривилегированныйРежим(Истина);
		
	НаборЗаписей = РегистрыНакопления.РасчетыСПоставщиками.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЗаказПоставщику);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Записать(Истина); 	
	
		
	НаборЗаписей = РегистрыНакопления.ТоварыКПоступлению.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЗаказПоставщику);
	НаборЗаписей.Прочитать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументПоступления,
	|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
	|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
	|	ТоварыКПоступлениюОстатки.Отправитель КАК Отправитель,
	|	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
	|	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток * -1 КАК КОформлениюНакладныхПоРаспоряжению,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоРаспоряжениюОстаток * -1 КАК КОформлениюПоступленийПоРаспоряжению,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоНакладнымОстаток * -1 КАК КОформлениюПоступленийПоНакладным,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток * -1 КАК КОформлениюПоступленийПоОрдерам,
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток * -1 КАК КОформлениюОрдеров,
	|	ТоварыКПоступлениюОстатки.ПринимаетсяОстаток * -1 КАК ПринимаетсяОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(, ДокументПоступления = &Распоряжение) КАК ТоварыКПоступлениюОстатки";
	Запрос.УстановитьПараметр("Распоряжение",ЗаказПоставщику );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись=НаборЗаписей.Добавить();
		НоваяЗапись.Период=ЗаказПоставщику.Дата;
		НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка); 		
	КонецЦикла;	
	НаборЗаписей.Записать(Истина);
	
	
	НаборЗаписей = РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЗаказПоставщику);
	НаборЗаписей.Прочитать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	|	ЗаказыПоставщикамОстатки.КодСтроки КАК КодСтроки,
	|	ЗаказыПоставщикамОстатки.Склад КАК Склад,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток * -1 КАК Заказано,
	|	ЗаказыПоставщикамОстатки.КОформлениюОстаток * -1 КАК КОформлению
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, ЗаказПоставщику = &Распоряжение) КАК ЗаказыПоставщикамОстатки";
	Запрос.УстановитьПараметр("Распоряжение",ЗаказПоставщику );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись=НаборЗаписей.Добавить();
		НоваяЗапись.Период=ЗаказПоставщику.Дата;
		НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка); 		
	КонецЦикла;	
	НаборЗаписей.Записать(Истина);
	
	
	
	ЗаказыПоставщику = Новый Массив;
	ЗаказыПоставщику.Добавить(ЗаказПоставщику);
	РегистрыСведений.СостоянияЗаказовПоставщикам.ОтразитьСостоянияЗаказов(ЗаказыПоставщику);
	//
	//РегистрыСведений.СостоянияЗаказовПоставщикам.ОтразитьСостояниеЗаказа(ЗаказПоставщику, Ложь);
	
	
	Набор = РегистрыСведений.СостоянияЗаказовПоставщикам.СоздатьНаборЗаписей();
	Набор.Отбор.Заказ.Установить(ЗаказПоставщику);
	НоваяЗапись =   Набор.Добавить();
	НоваяЗапись.Заказ =ЗаказПоставщику;
	НоваяЗапись.Состояние = Перечисления.СостоянияЗаказовПоставщикам.Закрыт;
	НоваяЗапись.ДатаСобытия = ТекущаяДата();
	
	Набор.Записать();

	
	
КонецПроцедуры


Процедура ПопыткаЗакрытияЗаказаПоставщику(ЗаказПоставщику)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.КОформлениюОстаток КАК КОформлениюОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику = &ЗаказПоставщику";
	Запрос.УстановитьПараметр("ЗаказПоставщику",ЗаказПоставщику );
	Если  Запрос.Выполнить().Пустой() Тогда
		ЗакрытьЗаказНаСервере(ЗаказПоставщику);
	КонецЕсли; 
	

КонецПроцедуры // ываыва()

Процедура ЗаполнитьЭтапыГрафикаОплаты(ДокументОбъект,Заказ,Сумма,ВариантОплаты=Неопределено)Экспорт 
	Если ВариантОплаты=Неопределено Тогда
	   ВариантОплаты=Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки;	
	КонецЕсли;
	
	
	Если ДокументОбъект.ЭтапыГрафикаОплаты.Количество()=0 Тогда
		НовыйЭтапГрафикаОплаты= ДокументОбъект.ЭтапыГрафикаОплаты.Добавить();
	    НовыйЭтапГрафикаОплаты.Заказ=Заказ; 
		НовыйЭтапГрафикаОплаты.ВариантОплаты=ВариантОплаты; 
		НовыйЭтапГрафикаОплаты.ДатаПлатежа=ДокументОбъект.Дата;
		НовыйЭтапГрафикаОплаты.СуммаПлатежа=Сумма;
		НовыйЭтапГрафикаОплаты.ПроцентПлатежа=100;
		НовыйЭтапГрафикаОплаты.СуммаВзаиморасчетов=НовыйЭтапГрафикаОплаты.СуммаПлатежа;
		НовыйЭтапГрафикаОплаты.ОбъектРасчетов=ДокументОбъект.Договор;
		НовыйЭтапГрафикаОплаты.ВариантОтсчета=Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
	КонецЕсли;
	
	

КонецПроцедуры

Процедура ПроверитьСостояниеЗаказаПоставщику(Заказы) Экспорт //+Лико m.shenderov 23.03.2023
	УстановитьПривилегированныйРежим(истина);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СостоянияЗаказовПоставщикам.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовПоставщикам КАК СостоянияЗаказовПоставщикам
	|ГДЕ
	|	СостоянияЗаказовПоставщикам.Заказ В(&Заказы)
	|	И СостоянияЗаказовПоставщикам.Состояние = &Состояние";
	Запрос.УстановитьПараметр("Заказы",Заказы );
	Запрос.УстановитьПараметр("Состояние",Перечисления.СостоянияЗаказовПоставщикам.ОжидаетсяПоступление);
	МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	
	
	Если Не ЗначениеЗаполнено(МассивЗаказов) Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
	|	СУММА(ЗаказПоставщикуТовары.Количество) КАК КоличествоПлан,
	|	0 КАК КоличествоФакт
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовПоставщикам КАК СостоянияЗаказовПоставщикам
	|		ПО (ЗаказПоставщикуТовары.Ссылка = СостоянияЗаказовПоставщикам.Заказ)
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&Заказы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение,
	|	0,
	|	СУММА(ПриходныйОрдерНаТоварыТовары.Количество)
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение В(&Заказы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СУММА(ВременнаяТаблица.КоличествоПлан) КАК КоличествоПлан,
	|	СУММА(ВременнаяТаблица.КоличествоФакт) КАК КоличествоФакт,
	|	(СУММА(ВременнаяТаблица.КоличествоПлан)-СУММА(ВременнаяТаблица.КоличествоФакт))/ СУММА(ВременнаяТаблица.КоличествоПлан) Как Остаток
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица.ЗаказПоставщику
	|	имеющие   
	|	(СУММА(ВременнаяТаблица.КоличествоПлан)-СУММА(ВременнаяТаблица.КоличествоФакт))/ СУММА(ВременнаяТаблица.КоличествоПлан)<0.07";
	Запрос.УстановитьПараметр("Заказы",МассивЗаказов );
	РезультатЗапроса = Запрос.Выполнить();   
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Набор = РегистрыСведений.СостоянияЗаказовПоставщикам.СоздатьНаборЗаписей();
		Набор.Отбор.Заказ.Установить(Выборка.ЗаказПоставщику);
		
		НоваяЗапись			=	Набор.Добавить();
		НоваяЗапись.Заказ			=	Выборка.ЗаказПоставщику;
		НоваяЗапись.Состояние		=	Перечисления.СостоянияЗаказовПоставщикам.ОжидаетсяОплатаПослеПоступления;
		
		Набор.Записать(Истина);
		
		
	КонецЦикла; 
	
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 23.03.2023



Процедура ЗаписатьСправочникВРежимеОбмена(МассивОБъектов) Экспорт  //+--->Лико m.shenderov 26.11.2025
  Для каждого Ссылка Из МассивОБъектов Цикл
  
  	    	
		СпрОбъект = Ссылка.ПолучитьОбъект();
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.Записать();
		
		КонецЦикла; 

КонецПроцедуры //-<---Лико m.shenderov 26.11.2025
